Repository: EdilbertoFonseca/BMI
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fi, pt_br, pt_pt, ru, tr, uk

source: &Calculate your BMI...
fi: &Laske kehonpainoindeksi...
pt_br: &Calcule seu IMC...
pt_pt: &Calcule seu IMC...
ru: &Рассчитать ИМТ...
tr: VKİ'ni hesapla...
uk: &Розрахуйте свій ІМТ...

source: BMI - Opens the Body Mass Index calculator.
pt_br: IMC - Abre a calculadora do Índice de Massa Corporal.

source: Height and weight must be greater than zero.
pt_br: A altura e o peso devem ser maiores que zero.
pt_pt: A altura e o peso devem ser superiores a zero.

source: Enter or select your height in centimeters:
pt_br: Digite ou selecione sua altura em centímetro:
pt_pt: Introduza ou selecione a sua altura em centímetros:

source: Enter or select your weight in kilograms:
pt_br: Digite ou selecione seu peso em quilogramas:
pt_pt: Introduza ou selecione o seu peso em quilogramas:

source: C&alculate
fi: &Laske
pt_br: C&alcular
pt_pt: C&alcular
ru: &Расчитать
tr: Hes&apla
uk: &Обчислити

source: C&lear
pt_br: &Limpar
pt_pt: &Apagar

source: &History
pt_br: &Histórico
pt_pt: &Histórico

source: &Cancel
fi: &Peruuta
pt_br: &Cancelar
pt_pt: &Cancelar
ru: &Отменить
tr: İ&ptal
uk: &Скасувати

source: Attention
fi: Huomio
pt_br: Atenção
pt_pt: Atenção
ru: Внимание
tr: Uyarı
uk: Увага

source: Ideal weight range for your height: {} kg to {} kg.
pt_br: Faixa de peso ideal para sua altura: {} kg a {} kg.
pt_pt: Intervalo de peso ideal para a sua altura: {} kg a {} kg.

source: Observation: For accurate BMI interpretation, several factors must be considered, including body composition, fat distribution, age, gender, and overall health. Consulting a healthcare professional is recommended for proper guidance.
pt_br: Observação: Para uma interpretação precisa do IMC, é importante considerar outros fatores, como composição corporal, distribuição de gordura, idade, gênero e saúde geral. É sempre recomendável consultar um profissional de saúde para obter orientação adequada sobre saúde e peso.

source: You are underweight.
pt_br: Você está abaixo do peso.

source: You are at a healthy weight.
pt_br: Você está em seu peso ideal.

source: You are overweight.
pt_br: Você está acima do peso.

source: You are significantly overweight.
pt_br: Você está acima do peso.

source: Your BMI indicates obesity.
pt_br: Você tem obesidade moderada.

source: Your BMI is {}. {} {} {}
pt_br: Seu IMC é {}. {} {} {}

source: No history found.
pt_br: Nenhum histórico encontrado.
pt_pt: Nenhum histórico encontrado.

source: History
pt_br: Histórico
pt_pt: Histórico

source: Last 10 BMI calculations:
pt_br: Últimos 10 cálculos de IMC:
pt_pt: Últimos 10 cálculos de IMC:

source: Date: {} | Height: {} cm | Weight: {} kg | BMI: {}
pt_br: Data: {} | Altura: {} cm | Peso: {} kg | IMC: {}
pt_pt: Data: {} | Altura: {} cm | Peso: {} kg | IMC: {}

source: An instance of {} is already open.
pt_br: Uma instância de {} já está aberta.

source: Calculation of the Body Mass Index.
pt_br: Cálculo do Índice de maça Corporal.
pt_pt: Cálculo do Índice de maça Corporal.

source: Calculate your BMI
fi: Kehonpainoindeksin laskeminen
pt_br: Calcule seu IMC
pt_pt: Calcule seu IMC
ru: Рассчитать свой индекс массы тела
tr: VKİ'ni Hesapla
uk: Розрахуйте свій ІМТ

source: This add-on calculates the Body Mass Index. Shortcut: Windows+Alt+I.
pt_br: Esse add-on calcula o Índice de Massa Corporal. Atalho: Windows+Alt+I.

source: Version compatible with NVDA 2026.1
pt_br: Versão compatível com NVDA 2026.1

source: BMI - This add-on calculates the Body Mass Index.
pt_pt: IMC - Este extra calcula o Índice de Massa Corporal.

source: Observation: For an accurate interpretation of BMI, it is important to consider other factors such as body composition, fat distribution, age, gender, and overall health. It is always recommended to consult a healthcare professional for proper guidance on health and weight.
pt_pt: Observação: Para uma interpretação exacta do IMC, é importante ter em conta outros factores, como a composição corporal, a distribuição da gordura, a idade, o sexo e a saúde em geral. Recomenda-se sempre a consulta de um profissional de saúde para uma orientação correta em matéria de saúde e peso.

source: Your BMI is {}. You are underweight. It is important to consult a doctor or nutritionist to identify healthy ways to gain weight. {} {}
pt_pt: O seu IMC é {}. Tem peso a menos. É importante consultar um médico ou nutricionista para identificar formas saudáveis de ganhar peso. {} {}

source: Your BMI is {}. You are at a healthy weight. Maintain it with a balanced diet and regular physical activity. {} {}
pt_pt: O seu IMC é {}. Tem um peso saudável. Mantenha-o com uma dieta equilibrada e atividade física regular. {} {}

source: Your BMI is {}. You are overweight. It is important to consult a doctor or nutritionist to identify healthy weight loss strategies. {} {}
pt_pt: O seu IMC é {}. Tem excesso de peso. É importante consultar um médico ou nutricionista para identificar estratégias saudáveis de perda de peso. {} {}

source: Your BMI is {}. You are significantly overweight. Please consult a healthcare provider for guidance. {} {}
pt_pt: O seu IMC é {}. Tem um excesso de peso significativo. Consulte um profissional de saúde para obter orientação. {} {}

source: Your BMI is {}. Your BMI indicates that you are in the obese range. It is important to consult a doctor to reduce health risks through safe weight loss. {} {}
pt_pt: O seu IMC é {}. O seu IMC indica que se encontra na faixa dos obesos. É importante consultar um médico para reduzir os riscos para a saúde através de uma perda de peso segura. {} {}

source: This add-on calculates the Body Mass Index. Shortcut: Windows+Alt+I.
pt_pt: Este extra calcula o Índice de Massa Corporal. Atalho: Windows+Alt+I.

source: BMI, This add-on calculates the body mass index.
fi: Tämä lisäosa laskee kehonpainoindeksin.
ru: ИМТ, это дополнение позволяет расчитать индекс массы тела.
tr: VKİ, Bu eklenti vücut kitle indeksini hesaplar.
uk: ІМТ, цей додаток обчислює індекс маси тіла.

source: Calculation of the Body mass Index.
fi: Kehonpainoindeksin laskeminen.
ru: Вычисление индекса массы тела.
tr: Vücut Kitle İndeksinizi hesaplayın.
uk: Обчислення індексу маси тіла.

source: Enter or select your height in centimeters:
fi: Syötä tai valitse pituutesi senttimetreinä:
ru: Введите или выберите свой рост в сантиметрах:
tr: Boyunuzu santimetre cinsinden girin veya seçin:
uk: Введіть або виберіть свій зріст у сантиметрах:

source: Enter or select your weight in kilograms:
fi: Syötä tai valitse painosi kilogrammoina:
ru: Введите или выберите свой вес в килограммах:
tr: Kilonuzu kilogram cinsinden girin veya seçin:
uk: Введіть або виберіть свою вагу в кілограмах:

source: C&lean
fi: T&yhjennä
ru: &Очистить
tr: Temiz&le
uk: &Очистити

source: Atention
fi: Huomio
ru: Внимание
tr: Uyarı
uk: Увага

source: Your BMI is {}. Your BMI indicates that you are underweight. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to gain weight in a healthy way. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
fi: Kehonpainoindeksisi on {}. Tulos osoittaa, että olet alipainoinen. On suositeltavaa keskustella lääkärin tai ravitsemusterapeutin kanssa terveytesi arvioimiseksi ja terveellisten painonlisäyskeinojen löytämiseksi. Huomautus: Kehonpainoindeksin oikea tulkinta vaatii myös muiden tekijöiden huomioon ottamista, kuten kehon koostumus, rasvan jakautuminen, ikä, sukupuoli ja yleinen terveydentila. On aina suositeltavaa kääntyä terveydenhuollon ammattilaisen, kuten lääkärin tai ravitsemusterapeutin puoleen saadaksesi tarkemman arvion ja ohjeet terveyteen ja painoon liittyen.
ru: Ваш ИМТ составляет {}. Ваш ИМТ указывает на то, что у вас недостаточный вес. Необходимо проконсультироваться с врачом или диетологом, чтобы оценить состояние своего здоровья и определить пути здорового набора веса. Наблюдение: Для правильной интерпретации ИМТ рекомендуется учитывать и другие факторы, такие как состав тела, распределение жира, возраст, пол и общее состояние здоровья человека. Для получения более точной оценки и правильных рекомендаций по здоровью и весу всегда рекомендуется обращаться к специалистам, например, к врачу или диетологу.
tr: VKİ'niz {}. VKİ'niz zayıf olduğunuzu gösteriyor. Sağlığınızı değerlendirmek, sağlıklı bir şekilde kilo vermenin ve sağlık risklerini azaltmanın yollarını belirlemek için bir doktora veya beslenme uzmanına danışmanız önemlidir. Gözlem: VKİ'nin doğru bir şekilde yorumlanması için vücut kompozisyonu, yağ dağılımı, yaş, cinsiyet ve kişinin genel sağlığı gibi diğer faktörlerin de göz önünde bulundurulması önerilir. Sağlık ve kilo konusunda daha doğru bir değerlendirme ve uygun rehberlik için her zaman bir doktor veya beslenme uzmanı gibi bir sağlık uzmanına danışmanız önerilir.

source: Your BMI is {}. Your BMI indicates that you are at a healthy weight. Keep it up by maintaining a balanced diet and regularly engaging in physical activity. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
fi: Kehonpainoindeksisi on {}. Tulos osoittaa, että olet normaalipainoinen. Jatka samaan malliin ylläpitämällä tasapainoista ruokavaliota ja harrastamalla säännöllisesti liikuntaa. Huomautus: Kehonpainoindeksin oikea tulkinta vaatii myös muiden tekijöiden huomioon ottamista, kuten kehon koostumus, rasvan jakautuminen, ikä, sukupuoli ja yleinen terveydentila. On aina suositeltavaa kääntyä terveydenhuollon ammattilaisen, kuten lääkärin tai ravitsemusterapeutin puoleen saadaksesi tarkemman arvion ja ohjeet terveyteen ja painoon liittyen.
ru: Ваш ИМТ составляет {}. Ваш ИМТ указывает на то, что у вас избыточный вес. Необходимо проконсультироваться с врачом или диетологом, чтобы оценить состояние своего здоровья и определить пути здорового снижения веса. Наблюдение: Для правильной интерпретации ИМТ рекомендуется учитывать и другие факторы, такие как состав тела, распределение жира, возраст, пол и общее состояние здоровья человека. Для получения более точной оценки и правильных рекомендаций по здоровью и весу всегда рекомендуется обращаться к специалистам, например, к врачу или диетологу.
tr: VKİ'niz {}. VKİ'niz sağlıklı bir kiloda olduğunuzu gösteriyor. Dengeli bir diyet uygulayarak ve düzenli olarak fiziksel aktivite yaparak bunu sürdürün. Gözlem: VKİ'nin doğru bir şekilde yorumlanması için vücut kompozisyonu, yağ dağılımı, yaş, cinsiyet ve kişinin genel sağlığı gibi diğer faktörlerin de göz önünde bulundurulması önerilir. Sağlık ve kilo konusunda daha doğru bir değerlendirme ve uygun rehberlik için her zaman bir doktor veya beslenme uzmanı gibi bir sağlık uzmanına danışmanız önerilir.

source: Your BMI is {}. Your BMI indicates that you are overweight. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to lose weight in a healthy way. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
fi: Kehonpainoindeksisi on {}. Tulos osoittaa, että olet ylipainoinen. On tärkeää keskustella lääkärin tai ravitsemusterapeutin kanssa terveytesi arvioimiseksi ja terveellisten painonpudotuskeinojen löytämiseksi. Huomautus: Kehonpainoindeksin oikea tulkinta vaatii myös muiden tekijöiden huomioon ottamista, kuten kehon koostumus, rasvan jakautuminen, ikä, sukupuoli ja yleinen terveydentila. On aina suositeltavaa kääntyä terveydenhuollon ammattilaisen, kuten lääkärin tai ravitsemusterapeutin puoleen saadaksesi tarkemman arvion ja ohjeet terveyteen ja painoon liittyen.
ru: Ваш ИМТ составляет {}. Ваш ИМТ указывает на то, что вы страдаете ожирением. Необходимо проконсультироваться с врачом или диетологом, чтобы оценить состояние своего здоровья и определить пути здорового снижения веса и уменьшения рисков для здоровья. Наблюдение: Для правильной интерпретации ИМТ рекомендуется учитывать и другие факторы, такие как состав тела, распределение жира, возраст, пол и общее состояние здоровья человека. Для получения более точной оценки и правильных рекомендаций по здоровью и весу всегда рекомендуется обращаться к специалистам, например, к врачу или диетологу.
tr: VKİ'niz {}. VKİ'niz aşırı kilolu olduğunuzu gösteriyor. Sağlığınızı değerlendirmek, sağlıklı bir şekilde kilo vermenin ve sağlık risklerini azaltmanın yollarını belirlemek için bir doktora veya beslenme uzmanına danışmanız önemlidir. Gözlem: VKİ'nin doğru bir şekilde yorumlanması için vücut kompozisyonu, yağ dağılımı, yaş, cinsiyet ve kişinin genel sağlığı gibi diğer faktörlerin de göz önünde bulundurulması önerilir. Sağlık ve kilo konusunda daha doğru bir değerlendirme ve uygun rehberlik için her zaman bir doktor veya beslenme uzmanı gibi bir sağlık uzmanına danışmanız önerilir.

source: Your BMI is {}. Your BMI indicates that you are overweight. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to lose weight in a healthy way. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
fi: Kehonpainoindeksisi on {}. Tulos osoittaa, että olet ylipainoinen. On tärkeää keskustella lääkärin tai ravitsemusterapeutin kanssa terveytesi arvioimiseksi ja terveellisten painonpudotuskeinojen löytämiseksi. Huomautus: Kehonpainoindeksin oikea tulkinta vaatii myös muiden tekijöiden huomioon ottamista, kuten kehon koostumus, rasvan jakautuminen, ikä, sukupuoli ja yleinen terveydentila. On aina suositeltavaa kääntyä terveydenhuollon ammattilaisen, kuten lääkärin tai ravitsemusterapeutin puoleen saadaksesi tarkemman arvion ja ohjeet terveyteen ja painoon liittyen.
ru: Ваш ИМТ составляет {}. Ваш ИМТ указывает на то, что у вас избыточный вес. Важно проконсультироваться с врачом или диетологом , чтобы оценить состояние своего здоровья и определить способы здорового похудения. Наблюдение: Для правильной интерпретации ИМТ рекомендуется учитывать другие факторы, такие как состав тела, распределение жира, возраст, пол и общее состояние здоровья человека. Всегда рекомендуется проконсультироваться с медицинским работником (врачом или диетологом) для получения более точной оценки и надлежащих рекомендаций по состоянию здоровья и весу.
tr: VKİ'niz {}. VKİ'niz aşırı kilolu olduğunuzu gösteriyor. Sağlığınızı değerlendirmek, sağlıklı bir şekilde kilo vermenin ve sağlık risklerini azaltmanın yollarını belirlemek için bir doktora veya beslenme uzmanına danışmanız önemlidir. Gözlem: VKİ'nin doğru bir şekilde yorumlanması için vücut kompozisyonu, yağ dağılımı, yaş, cinsiyet ve kişinin genel sağlığı gibi diğer faktörlerin de göz önünde bulundurulması önerilir. Sağlık ve kilo konusunda daha doğru bir değerlendirme ve uygun rehberlik için her zaman bir doktor veya beslenme uzmanı gibi bir sağlık uzmanına danışmanız önerilir.

source: Your BMI is {}. Your BMI indicates that you are obese. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to lose weight in a healthy way and reduce health risks. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
fi: Kehonpainoindeksisi on {}. Tulos osoittaa, että olet lihava. On tärkeää keskustella lääkärin tai ravitsemusterapeutin kanssa terveytesi arvioimiseksi, painonpudotuskeinojen löytämiseksi sekä terveysriskien vähentämiseksi. Huomautus: Kehonpainoindeksin oikea tulkinta vaatii myös muiden tekijöiden huomioon ottamista, kuten kehon koostumus, rasvan jakautuminen, ikä, sukupuoli ja yleinen terveydentila. On aina suositeltavaa kääntyä terveydenhuollon ammattilaisen, kuten lääkärin tai ravitsemusterapeutin puoleen saadaksesi tarkemman arvion ja ohjeet terveyteen ja painoon liittyen.
ru: Ваш ИМТ составляет {}. Ваш ИМТ указывает на то, что вы страдаете ожирением. Важно проконсультироваться с врачом или диетологом , чтобы оценить состояние своего здоровья и определить способы здорового похудения и снижения рисков для здоровья. Наблюдение: Для правильной интерпретации ИМТ рекомендуется учитывать другие факторы, такие как состав тела, распределение жира, возраст, пол и общее состояние здоровья человека. Всегда рекомендуется проконсультироваться с медицинским работником (врачом или диетологом) для получения более подробной информации. точная оценка и надлежащие рекомендации по состоянию здоровья и весу.
tr: VKİ'niz {}. VKİ'niz obez olduğunuzu gösteriyor. Sağlığınızı değerlendirmek, sağlıklı bir şekilde kilo vermenin ve sağlık risklerini azaltmanın yollarını belirlemek için bir doktora veya beslenme uzmanına danışmanız önemlidir. Gözlem: VKİ'nin doğru bir şekilde yorumlanması için vücut kompozisyonu, yağ dağılımı, yaş, cinsiyet ve kişinin genel sağlığı gibi diğer faktörlerin de göz önünde bulundurulması önerilir. Sağlık ve kilo konusunda daha doğru bir değerlendirme ve uygun rehberlik için her zaman bir doktor veya beslenme uzmanı gibi bir sağlık uzmanına danışmanız önerilir.

source: This addon calculates the body mass index.
fi: Tämä lisäosa laskee kehonpainoindeksin.
ru: Это дополнение позволяет расчитать индекс массы тела.
tr: Bu eklenti vücut kitle indeksini hesaplar.
uk: Цей аддон обчислює індекс маси тіла.

source: Your BMI is {}. Your BMI indicates that you are underweight. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to gain weight in a healthy way. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
uk: Ваш ІМТ - {}. Ваш ІМТ вказує на те, що у вас недостатня вага. Важливо проконсультуватися з лікарем або дієтологом, щоб оцінити стан вашого здоров'я та визначити шляхи здорового набору ваги. Спостереження: Для правильної інтерпретації ІМТ рекомендується враховувати інші фактори, такі як склад тіла, розподіл жиру, вік, стать і загальний стан здоров'я людини. Завжди рекомендується проконсультуватися з медичним працівником, наприклад, лікарем або дієтологом, для більш точної оцінки та належних рекомендацій щодо здоров'я і ваги.

source: Your BMI is {}. Your BMI indicates that you are at a healthy weight. Keep it up by maintaining a balanced diet and regularly engaging in physical activity. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
uk: Ваш ІМТ - {}. Ваш ІМТ вказує на те, що ви маєте здорову вагу. Підтримуйте її, дотримуючись збалансованого харчування та регулярно займаючись фізичною активністю. Спостереження: Для правильної інтерпретації ІМТ рекомендується враховувати інші фактори, такі як склад тіла, розподіл жиру, вік, стать і загальний стан здоров'я людини. Завжди рекомендується проконсультуватися з медичним працівником, наприклад, лікарем або дієтологом, для більш точної оцінки та отримання належних рекомендацій щодо здоров'я та ваги.

source: Your BMI is {}. Your BMI indicates that you are overweight. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to lose weight in a healthy way. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
uk: Ваш ІМТ - {}. Ваш ІМТ вказує на те, що ви маєте надлишкову вагу. Важливо проконсультуватися з лікарем або дієтологом, щоб оцінити стан вашого здоров'я та визначити шляхи здорового схуднення. Спостереження: Для правильної інтерпретації ІМТ рекомендується враховувати інші фактори, такі як склад тіла, розподіл жиру, вік, стать і загальний стан здоров'я людини. Завжди рекомендується проконсультуватися з медичним працівником, наприклад, лікарем або дієтологом, для більш точної оцінки та отримання належних рекомендацій щодо здоров'я і ваги.

source: Your BMI is {}. Your BMI indicates that you are obese. It's important to consult a doctor or nutritionist to evaluate your health and identify ways to lose weight in a healthy way and reduce health risks. Observation: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a healthcare professional, such as a physician or nutritionist, for a more accurate assessment and proper guidance on health and weight.
uk: Ваш ІМТ - {}. Ваш ІМТ вказує на те, що у вас ожиріння. Важливо проконсультуватися з лікарем або дієтологом, щоб оцінити стан вашого здоров'я та визначити шляхи здорового схуднення і зниження ризиків для здоров'я. Спостереження: Для правильної інтерпретації ІМТ рекомендується враховувати інші фактори, такі як склад тіла, розподіл жиру, вік, стать і загальний стан здоров'я людини. Завжди рекомендується проконсультуватися з медичним працівником, наприклад, лікарем або дієтологом, для більш точної оцінки та отримання належних рекомендацій щодо здоров'я і ваги.
